

//The folowing is modified to match "xff\0"-files, rather than "XFF2" files!:
      
struct t_xff0Hdr {
   unsigned char ident[4];    //00  "xff\0"  /   "xff2"
   unsigned int unk04;        //04   0   type, machine ? - never read   //File can contain multiple XFF headers for Tab7 (relocation stuff)   
   unsigned int nextHdr;    	//08   0   Pointer to another XFF header with Tab7 within file 

//Number of special sections = type+1; if type=0 => numOfSpecialSect=2
//used by strHash sub_1B4498
//if !=0 => typeProc = type+1 ; else typeProc = type(=0)+2
//special entries in the beginning of symTab??
// if ((SymTabNrEnt - (typeProc + tab20NrEnt)) == 0) some entry of communication struct is written
// else SymTabNrEnt = (SymTabNrEnt - (typeProc + tab20NrEnt))
// those are the first special entries in symTab
// This is "numberOfSpecialSect - 1" - this number does not include the zero at the start of SymTab!

   unsigned int SpecSectNr;	//0C   6=exe; 9=script/text? 0xF (iosKernel = ?) //type;
    // =0 in file
    
   //10 writen by DecodeSection_sub_100278 
   unsigned int entry;        //10   entry point function addr. Written on load, before that is =0
   //(about the following:) +0x00010000 ??
   unsigned int flSz; //stackRel;     //14  MAY ALSO BE "NEXT FILE START" Stack relative to start of file addr. (points right after the end of file) XXXX NOT: section header table offset from beginning of file
   // =0 in file
   //18 written by RelocateElfInfoHeader_sub_1004b8
   unsigned int stackAbs;     //18   MAY ALSO BE "NEXT FILE START" Stack absolute addr. (=0 before load) XXXX NOT: absolute section header offset in memory (before loading = 0)

   unsigned int expSymTabNrE; //1C   size of the following table [words] = [entries]   
   //vvvv +0x40010000   
   //20 The unk20Tab should be multiplied by 16 and added to symTab
   // (symTab + unk20EntryValue*16) are local entries for which to compute string hash value?? 
   //This table might specify whether to hash a name so that it can be linked - otherwise it will remain local.
   //in short - it specifies which funcs are exported (unk20EntValue *16 + symTab).
   //Number of each entry (1 word) in symTab, for the name string of which, 
   //hash will be computed for it to be externally exported.
	//Holds Exported and Imported symbols! 
	//Only simbols that are exclusively for internal use are not in this table! 

//WARNING: ABOVE IS INCORRECT: THIS IS TABLE OF UNEXPORTED SYMBOLS! Symbols with "sect"field (wrong name?) = 1 are exported, while those with 0 are not!
//this is more-of-a table of "internally-used symbols" 
//Table (only) of imported symbols.  Symbols with indexes in this table are not visible to external modules (if they originate from this module), and are visible to this module (only). 
//The remaining symbols (from symTab) are visible to external modules (if created by this module), but if among them there is an external function, it will not be visible for this module. 
//In the current implementation, the symbols of this table are those with "sect" == 0. 
 
   unsigned int expSymTab;    //20   growing numbers - 7, 8, 9, 0xC, 0xF, .. some are skipped

   unsigned int symTabNrE;    //24   size of the Symbol table [entries] (1 entry = 4 words = 16 bytes)    
   //vvvv +0x40010000 
   //handled (also) by RelocateSelfSymbol_sub_1018b8
   unsigned int SymTab;       //28   Symbol table offset (before loading = from start of file), after load = absolute 
   //vvvv +0x40010000 
   unsigned int SymTabStr;    //2C   Strings used by the entries in the Symbol Table
   //vvvv +0x40010000 
   unsigned int SectTab;      //30   Section header table? - "xff2-table" - see below 
   //vvvv +0x40010000 
   unsigned int symRelTab;    //34   Relative addr. of each entry in symTab based on (offset from the start) its section. some table of strange values - mostly middle numbers 
   unsigned int RelTabNrE;  	//38   Size in entries of the Relocation Table (contains 7-word structs, each of which points to two tables - foer addr and instr.
   //vvvv +0x40010000 
   //3C Tab7 seems to hold structs which specify how to relocated code
   //Handles (also) by RelocateCode_sub_1016e8
	//
   unsigned int relocTab;    	//3C   some table headers ... see "7-entry table"   "Tab7"  
   unsigned int SectNrE;    	//40   Number of Sections (entries)  //ssNameSz;  Special Sections Names Table Size [entries] - The zero section included.
   //vvvv +0x40010000  
//AKA xSectStrPnt_t
   unsigned int ssNamePt;     //44   Special Sections Names Table offsets (from the following word) 
   //vvvv +0x40010000 
   unsigned int ssNameBs;     //48   Base addr. for the special sections' strings (names)
   
   //from here relative to the start of file offseys start:
   unsigned int entry_Rel;       //4C  relative offset in code section of extry point function
   unsigned int expSymTab_Rel;   //50
   unsigned int SymTab_Rel;      //54
   unsigned int SymTabStr_Rel;   //58
   unsigned int SectTab_Rel;     //5C
   unsigned int symRelTab_Rel;   //60
   unsigned int relocTab_Rel;   	//64
   unsigned int ssNamePt_Rel;    //68
   unsigned int ssNameBs_Rel;    //6C
};




int xffFindSectNrByName(char *sectName, void *flBuf, u32 xffSz) {
   int i, j=0, k=0;
   struct xffHdr_t *xffHdr = flBuf;
  
  //Using a fixed buffer (maybe with malloc()), that contains the whole file.
  //Note that with the PS2's RAM limited to 32MB and how XFF files are processed,
  //it is unlikely that there exists an XFF file of more than 10MB... but this is only a speculation.
  
   u32 xffFlStart = (u32)flBuf;
   
   if (xffHdr->stackRel != xffSz) {
      //printf("\n ERR: stackRel = XFF file size  %08X != %08X  XFF file size  \n", xffHdr->stackRel, xffSz);   
      return -3;
   }
   struct xSectStrPnt_t *xSSPnt;
   xSSPnt = (void*)(xffFlStart + xffHdr->ssNamePt_Rel);
   if (xffHdr->ssNamePt_Rel >= xffSz) {
      //printf("\n ERR: ssNamePt outside file %08X >= %08X \n", xffHdr->ssNamePt_Rel, xffSz);   
      return -4;
   }
   //char *xSSNameStr = (void*)(xffFlStart + xffHdr->ssNameBs + xSSPnt[i].offs);
